app/controllers/admin_users_controller.rb

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT 1  [["id", 1]]
---
  def delete
    @admin_user = AdminUser.find(params[:id])