app/controllers/pages_controller.rb

  def index
    #@pages = Page.all
     @pages = Page.where(:subject_id => @subject.id).sorted
---
SELECT "pages".* FROM "pages" WHERE "pages"."subject_id" = ?  ORDER BY pages.position ASC  [["subject_id", 1]]

  def new
    @page = Page.new({:subject_id => @subject.id, :name => "Default"})
    @subjects = Subject.order('position ASC')
    @page_count = Page.count + 1
---
SELECT "subjects".* FROM "subjects"  ORDER BY position ASC
SELECT COUNT(*) FROM "pages"

  def create
    @page = Page.new(page_params)
    if @page.save
      flash[:notice] = "Page created successfully."
      redirect_to(:action => 'index', :subject_id => @subject.id)
    else
      @subjects = Subject.order('position ASC')
      @page_count = Page.count + 1
---
INSERT INTO "pages" ("subject_id", "name", "permalink", "position", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["subject_id", 1], ["name", "Nischal"], ["permalink", "first"], ["position", 1], ["visible", "t"], ["created_at", "2016-04-24 12:21:25.678017"], ["updated_at", "2016-04-24 12:21:25.678017"]]
SELECT "subjects".* FROM "subjects"  ORDER BY position ASC
SELECT COUNT(*) FROM "pages"

  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count = Page.count
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
SELECT "subjects".* FROM "subjects"  ORDER BY position ASC
SELECT COUNT(*) FROM "pages"

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pages" SET "permalink" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["permalink", "{id}-nischal"], ["updated_at", "2016-04-25 19:43:49.331495"], ["id", 2]]

  def delete
    @page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 3]]

  def destroy
    page = Page.find(params[:id]).destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 3]]
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 3]]

  def find_subject
    if params[:subject_id]
      @subject = Subject.find(params[:subject_id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]