app/controllers/public_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."permalink" = ? AND "pages"."visible" = ?  ORDER BY "pages"."id" ASC LIMIT 1  [["permalink", "first"], ["visible", "t"]]
---
  def show
    @page = Page.where(:permalink => params[:permalink], :visible => true).first