app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @section = Section.new({:page_id => @page.id, :name => "Default"})
    @pages = @page.subject.pages.sorted
    @section_count = Section.count + 1
---
SELECT COUNT(*) FROM "sections"

  def create
    @section = Section.new(section_params)
    if @section.save
      flash[:notice] = "Section created successfully."
      redirect_to(:action => 'index', :page_id => @page.id)
    else
      @pages = @page.subject.pages.sorted
      @section_count = Section.count + 1
---
INSERT INTO "sections" ("page_id", "name", "position", "visible", "content_type", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "sections"

  def edit
    @section = Section.find(params[:id])
    @pages = @page.subject.pages.sorted
    @section_count = Section.count
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "sections"

  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(section_params)
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "sections" SET "name" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["name", "Archit2"], ["updated_at", "2016-04-25 15:51:31.520702"], ["id", 2]]

  def delete
    @section = Section.find(params[:id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    section = Section.find(params[:id]).destroy
---
DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 2]]
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 2]]

  def find_page
    if params[:page_id]
      @page = Page.find(params[:page_id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 2]]