app/controllers/subjects_controller.rb

  def show
    @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]

  def new
    @subject = Subject.new({:name => "Default"})
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM "subjects"

  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save
---
INSERT INTO "subjects" ("name", "position", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Physics"], ["position", 1], ["visible", "t"], ["created_at", "2016-04-24 12:20:00.000000"], ["updated_at", "2016-04-24 12:20:33.213766"]]

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "subjects"

  def update
    # Find an existing object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(subject_params)
      # If update succeeds, redirect to the index action
      flash[:notice] = "Subject updated successfully."
      redirect_to(:action => 'show', :id => @subject.id)
    else
      # If update fails, redisplay the form so user can fix problems
      @subject_count = Subject.count
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "subjects" SET "position" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["position", 1], ["updated_at", "2016-04-25 15:37:36.596608"], ["id", 2]]
SELECT COUNT(*) FROM "subjects" WHERE (1 = 1) AND (position = 1)

  def delete
    @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 4]]

  def destroy
    subject = Subject.find(params[:id]).destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 4]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 4]]