app/views/public/show.html.erb


<% @page.sections.visible.sorted.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."page_id" = ? AND "sections"."visible" = ?  ORDER BY sections.position ASC  [["page_id", 1], ["visible", "t"]]